cf/InformationRegisters/CurrencyExchangeRates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>CurrencyExchangeRates</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>9</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>NBPTableNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Documents/BookkeepingOperation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>BookkeepingOperation</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.VATRegisterPurchase</xr:Item>
				<xr:Item>AccountingRegister.Bookkeeping</xr:Item>
				<xr:Item>InformationRegister.DocumentHierarchy</xr:Item>
				<xr:Item>AccumulationRegister.VATRegisterSales</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Amount</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.DocumentAuthor</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BookkeepingOperationsTemplate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BookkeepingOperationsTemplates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Company</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Currency</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentBase</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ExchangeRate</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GroupRecords</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InitialDocumentDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InitialDocumentNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Manual</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OperationType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OperationTypesBookkeepingOperation</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PartialJournal</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Records</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Account</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Bookkeeping</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExtDimension1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.BookkeepingExtDimensions</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExtDimension2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.BookkeepingExtDimensions</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExtDimension3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.BookkeepingExtDimensions</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Quantity</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Currency</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CurrencyAmount</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Amount</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AmountDr</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Amount</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AmountCr</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Amount</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Description</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Type</Name>
							<Type>
								<v8:Type>cfg:EnumRef.BookkeepingOperationRecordTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>RequestedParameters</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SalesVATRecords</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Document</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.VATSalesDocument</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NetAmount</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Amount</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Partner</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.VATCustomer</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Period</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VAT</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Amount</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VATRate</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.VATRate</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Type</Name>
							<Type>
								<v8:Type>cfg:EnumRef.BookkeepingOperationRecordTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>PurchaseVATRecords</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Document</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.VATPurchaseDocument</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NetAmount</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Amount</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Partner</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.VATCustomer</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Period</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VAT</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Amount</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VATRate</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.VATRate</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Type</Name>
							<Type>
								<v8:Type>cfg:EnumRef.BookkeepingOperationRecordTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/CommonModules/DialogsAtClient/Ext/Module.bsl
Function WriteObjectInForm(Form,WriteParameters,CommandPresentation) Export 
	
	If Form.Parameters.Key.IsEmpty() Then
		
		QueryBoxText = CommonAtClientAtServer.ParametrizeString(Nstr("en = 'Data has not been written yet.
                          |Performing command ""%P1"" will be possible only after data will be written.
                          |Data will be written.'; pl = 'Dane jeszcze nie zostałe zapisane.
                          |Wykonanie polecenia ""%P1"" będzie możliwe tylko po zapisaniu danych.
                          |Dane zostaną zapisane.'"),New Structure("P1",CommandPresentation));
		QueryBoxResult = DoQueryBox(QueryBoxText, QuestionDialogMode.OKCancel);
		
		If QueryBoxResult <> DialogReturnCode.OK Then 
			Return False;	
		EndIf;	
		
		Return Form.Write(WriteParameters);
	Else
		Return True;
	EndIf;
			
EndFunction // WriteObjectInForm()

Procedure WriteObjectInFormRequest(Form, CommandPresentation, NotifyDescriptionOnProceed) Export 
	QueryText	= CommonAtClientAtServer.ParametrizeString(Nstr("en = 'Data has not been written yet.
                          |Performing command ""%P1"" will be possible only after data will be written.
                          |Data will be written.'; pl = 'Dane jeszcze nie zostałe zapisane.
                          |Wykonanie polecenia ""%P1"" będzie możliwe tylko po zapisaniu danych.
                          |Dane zostaną zapisane.'"),New Structure("P1",CommandPresentation));
						  
	NotifyParams= New Structure("NotifyDescriptionOnProceed, Form", NotifyDescriptionOnProceed, Form);
	NotifyDescr	= New NotifyDescription("WriteObjectInFormResponse", DialogsAtClient, NotifyParams);
	
	ShowQueryBox(NotifyDescr, QueryText, QuestionDialogMode.OKCancel);
EndProcedure

Procedure WriteObjectInFormResponse(Answer, Parameters) Export 
	If Answer <> DialogReturnCode.OK Then
		Return;
	EndIf;
	
	If Parameters.Form.Write() Then 
		ExecuteNotifyProcessing(Parameters.NotifyDescriptionOnProceed);
	EndIf;
EndProcedure

Procedure ExchangeRateStartListChoice(Item, StandartProcessing, Form, Currency, InOutExchangeRate, OutExchangeRateDate = Undefined, OutNBPTableNumber = Undefined) Export
	
	StandartProcessing = False;
	
	ExchangeRatesValueList = CurrenciesAtServer.GetExchangeRatesValueList(Currency,New Structure("ExchangeRate, Period, NBPTableNumber"));
		
	ExchangeRatesValueList.Add(Undefined, NStr("en=""Choose from list...""; pl=""Wybierz z listy..."""));
	
	CurrentValue = Undefined;
	
	For i=0 To ExchangeRatesValueList.Count()-2 Do
		
		If ExchangeRatesValueList[i].Value.ExchangeRate = InOutExchangeRate 
			AND (OutExchangeRateDate = Undefined OR BegOfDay(ExchangeRatesValueList[i].Value.Period) = BegOfDay(OutExchangeRateDate))
			AND (OutNBPTableNumber = Undefined OR ExchangeRatesValueList[i].Value.NBPTableNumber = OutNBPTableNumber) Then
			CurrentValue = i;
			Break;
		EndIf;	
		
	EndDo;	
	
	NotifyDescr	= New NotifyDescription("ExchangeRateStartListChoiceEnd", DialogsAtClient,
			New Structure("OutExchangeRateDate, Currency, Item, Form", OutExchangeRateDate, Currency, Item, Form));
	Form.ShowChooseFromList(NotifyDescr, ExchangeRatesValueList, Item, CurrentValue);
	
EndProcedure // GlobalExchangeRateStartListChoice()

&AtClient
Procedure ExchangeRateStartListChoiceEnd(ValueListItem, QueryParameters)  Export

	OutExchangeRateDate	= QueryParameters.OutExchangeRateDate;
	Currency			= QueryParameters.Currency;
	Item				= QueryParameters.Item;
	Form				= QueryParameters.Form;
	
	If ValueListItem = Undefined Then
		Return;
	ElsIf ValueListItem.Value = Undefined Then
		FormParameters = New Structure("ChoiceMode, ReturnRow, Filter",True,(OutExchangeRateDate<>Undefined),New Structure("Currency",Currency));
		OpenForm("InformationRegister.CurrencyExchangeRates.ListForm",FormParameters,?(OutExchangeRateDate<>Undefined,Form,Item),Item,,,,FormWindowOpeningMode.LockOwnerWindow);
	Else
		InOutExchangeRate = ValueListItem.Value.ExchangeRate;
		OutExchangeRateDate = ValueListItem.Value.Period;
		OutNBPTableNumber = ValueListItem.Value.NBPTableNumber;
	EndIf;
EndProcedure

// Jack 29.06.2017
//Procedure UnitOfMeasureStartListChoice(Item, StandartProcessing, Form, CurrentDataItem, CurrentUnitOfMeasure, Object = Undefined, OldUnitOfMeasure = Undefined) Export
//	
//	StandartProcessing = False;
//	
//	UnitOfMeasureValueList = ControlsProcessingAtServer.GetItemsUnitsOfMeasureValueList(CurrentDataItem);
//		
//	CurrentValue = Undefined;
//	
//	For i=0 To UnitOfMeasureValueList.Count()-1 Do
//		
//		If UnitOfMeasureValueList[i].Value = CurrentDataItem  Then
//			CurrentValue = i;
//			Break;
//		EndIf;	
//		
//	EndDo;	
//	
//	#If NOT ThickClientOrdinaryApplication Then
//		Descr		= New NotifyDescription("HandleValueOfChoiseFromList", Object, New Structure("OldUnitOfMeasure", OldUnitOfMeasure));
//		Form.ShowChooseFromList(Descr, UnitOfMeasureValueList, Item);
//	#Else
//		ValueListItem = Form.ChooseFromList(UnitOfMeasureValueList, Item, CurrentValue);
//		
//		If ValueListItem = Undefined Then
//			Return;
//		Else
//			CurrentUnitOfMeasure = ValueListItem.Value;
//		EndIf;
//	#EndIf
//	
//EndProcedure // UnitOfMeasureStartListChoice()

Procedure NumericValueStartListChoice(Item, StandartProcessing, Form, ValueArray, TableName, AttributeName) Export
	StandartProcessing = False;	
	CurrentRow = Form.Object[TableName].FindByID(Form.Items[TableName].CurrentRow);

	ChoiceValueList = New ValueList;		
	For Each CurrentValue In ValueArray Do
		ChoiceValueList.Add(CurrentValue);		
	EndDo;
	
	NotifyDescr	= New NotifyDescription("NumericValueStartListChoiceEnd", DialogsAtClient,
			New Structure("CurrentRow, AttributeName", CurrentRow, AttributeName));
			
	Form.ShowChooseFromList(NotifyDescr, ChoiceValueList, Item, CurrentRow[AttributeName]);
EndProcedure // NumericValueStartListChoice()

Procedure NumericValueStartListChoiceEnd(ValueListItem, QueryParameters) Export 
	If ValueListItem <> Undefined Then
		QueryParameters.CurrentRow[QueryParameters.AttributeName] = ValueListItem.Value;
	EndIf;	
EndProcedure

Procedure ShowBookkeepingOperation(DocumentRef) Export 
	
	Answer = DialogsAtServer.GetBookkeepingOperation(DocumentRef);
	If Answer.Success Then
		ShowValue(,Answer.BookkeepingOperation);
	Else	
		If Answer.ShowMessage Then
			ShowMessageBox(,Answer.Message);		
		EndIf;
		If Answer.Empty Then
			NotifyParameters = New Structure;
			NotifyParameters.Insert("DocumentRef",DocumentRef);			
			NotifyDescription = New NotifyDescription("QueryNewBookkeepingOperationAnswer",DialogsAtClient,NotifyParameters);
			ShowQueryBox(NotifyDescription,NStr("en = 'For this document bookkeeping operation does not exists. Do you want to create a new one bookkeeping operation?'; pl = 'Na podstawie tego dokumentu nie został zaksięgowany dowód księgowy. Czy chcesz stworzyć nowy dowód księgowy?'"),QuestionDialogMode.YesNo);
		EndIf;		

	EndIf;
EndProcedure

&AtClient
Procedure QueryNewBookkeepingOperationAnswer(Answer, Parameters)  Export
	If Answer = DialogReturnCode.Yes Then
		OpenForm("Document.BookkeepingOperation.ObjectForm",New Structure("Basis",Parameters.DocumentRef));
	EndIf;
EndProcedure
